{
  "status": {
    "code": "200",
    "message": "Thành công",
    "label": "Success"
  },
  "data": [
    {
      "id": 1,
      "author": "Nguyen Van A",
      "content": "Apple vừa ra mắt dòng iPhone mới với những cải tiến đột phá về camera và thời lượng pin. Chip xử lý mới cũng mang lại hiệu năng vượt trội so với các thế hệ trước.",
      "createdAt": "2025-05-06T08:00:00",
      "description": "Đánh giá chi tiết về iPhone mới nhất và những tính năng nổi bật",
      "image": "https://placehold.co/600x400",
      "title": "Đánh giá iPhone 2025: Đột phá công nghệ",
      "categoryName": "technology"
    },
    {
      "id": 2,
      "author": "Tran Thi B",
      "content": "Thiền định 15 phút mỗi ngày có thể giúp giảm căng thẳng, cải thiện sự tập trung và nâng cao chất lượng giấc ngủ. Bài viết hướng dẫn cách thực hành thiền đơn giản cho người mới bắt đầu.",
      "createdAt": "2025-05-06T07:30:00",
      "description": "Hướng dẫn thực hành thiền định cho người bận rộn",
      "image": "https://placehold.co/600x400",
      "title": "15 phút thiền mỗi ngày - thay đổi cuộc sống",
      "categoryName": "health"
    },
    {
      "id": 3,
      "author": "Le Van C",
      "content": "Hội An không chỉ nổi tiếng với phố cổ mà còn có những bãi biển tuyệt đẹp và ẩm thực đa dạng. Bài viết chia sẻ lịch trình 3 ngày khám phá Hội An một cách trọn vẹn.",
      "createdAt": "2025-05-06T07:00:00",
      "description": "Khám phá Hội An trong 3 ngày với chi phí tiết kiệm",
      "image": "https://placehold.co/600x400",
      "title": "Hội An - Trải nghiệm 3 ngày đáng nhớ",
      "categoryName": "travel"
    },
    {
      "id": 4,
      "author": "Pham Thi D",
      "content": "Phương pháp Pomodoro giúp tăng năng suất học tập bằng cách chia thời gian thành các khung 25 phút tập trung cao độ, xen kẽ với các khoảng nghỉ ngắn. Áp dụng đúng cách sẽ giúp bạn học hiệu quả hơn.",
      "createdAt": "2025-05-06T06:30:00",
      "description": "Tăng hiệu quả học tập với phương pháp Pomodoro",
      "image": "https://placehold.co/600x400",
      "title": "Phương pháp Pomodoro - Bí quyết học tập hiệu quả",
      "categoryName": "education"
    },
    {
      "id": 5,
      "author": "Hoang Van E",
      "content": "Đầu tư sớm và đều đặn là chìa khóa để đạt được tự do tài chính. Bài viết phân tích các chiến lược đầu tư phù hợp với từng độ tuổi và mức thu nhập.",
      "createdAt": "2025-05-06T06:00:00",
      "description": "Chiến lược đầu tư thông minh cho người trẻ",
      "image": "https://placehold.co/600x400",
      "title": "Bắt đầu đầu tư từ tuổi 20 - Con đường đến tự do tài chính",
      "categoryName": "finance"
    },
    {
      "id": 6,
      "author": "Nguyen Thi F",
      "content": "Phở là món ăn đại diện cho ẩm thực Việt Nam với hương vị đặc trưng. Bài viết chia sẻ công thức nấu phở bò truyền thống chuẩn vị Hà Nội cho những người yêu thích ẩm thực.",
      "createdAt": "2025-05-06T05:30:00",
      "description": "Công thức nấu phở bò truyền thống tại nhà",
      "image": "https://placehold.co/600x400",
      "title": "Bí quyết nấu phở bò chuẩn vị Hà Nội",
      "categoryName": "food"
    },
    {
      "id": 7,
      "author": "Tran Van G",
      "content": "Xu hướng 'minimalism' đang ngày càng phổ biến giúp giảm stress và tạo không gian sống thoáng đãng. Bài viết hướng dẫn cách áp dụng lối sống tối giản vào cuộc sống hàng ngày.",
      "createdAt": "2025-05-06T05:00:00",
      "description": "Áp dụng lối sống tối giản để giảm stress",
      "image": "https://placehold.co/600x400",
      "title": "Sống tối giản - Hạnh phúc từ những điều đơn giản",
      "categoryName": "lifestyle"
    },
    {
      "id": 8,
      "author": "Le Thi H",
      "content": "Các nhà khoa học đã phát hiện ra một loài động vật biển mới có khả năng tái tạo tế bào đặc biệt, mở ra triển vọng cho y học tái tạo và điều trị các bệnh thoái hóa.",
      "createdAt": "2025-05-06T04:30:00",
      "description": "Phát hiện mới về khả năng tái tạo tế bào ở sinh vật biển",
      "image": "https://placehold.co/600x400",
      "title": "Sinh vật biển mới - Chìa khóa cho y học tái tạo",
      "categoryName": "science"
    },
    {
      "id": 10,
      "author": "Hoang Thi J",
      "content": "AI đang thay đổi cách các doanh nghiệp phát triển sản phẩm và tương tác với khách hàng. Bài viết phân tích các xu hướng AI đang định hình tương lai công nghệ.",
      "createdAt": "2025-05-05T09:00:00",
      "description": "Xu hướng AI đang thay đổi ngành công nghệ",
      "image": "https://placehold.co/600x400",
      "title": "AI trong năm 2025 - Những bước tiến đột phá",
      "categoryName": "technology"
    },
    {
      "id": 11,
      "author": "Nguyen Van K",
      "content": "Các công nghệ mới như blockchain đang mang lại cách tiếp cận mới cho bảo mật dữ liệu. Bài viết phân tích các giải pháp bảo mật hiện đại dành cho doanh nghiệp.",
      "createdAt": "2025-05-04T10:00:00",
      "description": "Giải pháp bảo mật dữ liệu hiện đại cho doanh nghiệp",
      "image": "https://placehold.co/600x400",
      "title": "Blockchain và tương lai của bảo mật dữ liệu",
      "categoryName": "technology"
    },
    {
      "id": 12,
      "author": "Tran Thi L",
      "content": "5G đang tạo ra cuộc cách mạng về kết nối và truyền dữ liệu. Bài viết khám phá cách 5G đang thay đổi cuộc sống và công việc của chúng ta.",
      "createdAt": "2025-05-03T11:00:00",
      "description": "Tác động của 5G đến cuộc sống hiện đại",
      "image": "https://placehold.co/600x400",
      "title": "5G - Kỷ nguyên mới của kết nối",
      "categoryName": "technology"
    },
    {
      "id": 13,
      "author": "Le Van M",
      "content": "Điện toán đám mây đang mang lại những lợi ích to lớn cho doanh nghiệp về tính linh hoạt và tiết kiệm chi phí. Bài viết phân tích các giải pháp điện toán đám mây phù hợp cho từng loại doanh nghiệp.",
      "createdAt": "2025-05-02T12:00:00",
      "description": "Lựa chọn giải pháp điện toán đám mây phù hợp",
      "image": "https://placehold.co/600x400",
      "title": "Điện toán đám mây - Giải pháp cho doanh nghiệp hiện đại",
      "categoryName": "technology"
    },
    {
      "id": 14,
      "author": "Pham Thi N",
      "content": "Internet of Things (IoT) đang kết nối mọi thiết bị trong cuộc sống của chúng ta. Bài viết khám phá các ứng dụng thông minh của IoT trong đời sống hàng ngày.",
      "createdAt": "2025-05-01T13:00:00",
      "description": "Ứng dụng của IoT trong đời sống thường ngày",
      "image": "https://placehold.co/600x400",
      "title": "IoT - Kết nối thông minh cho ngôi nhà hiện đại",
      "categoryName": "technology"
    },
    {
      "id": 15,
      "author": "Hoang Van O",
      "content": "Thực tế ảo đang mang lại trải nghiệm hoàn toàn mới trong giải trí và giáo dục. Bài viết đánh giá các thiết bị VR mới nhất trên thị trường.",
      "createdAt": "2025-04-30T14:00:00",
      "description": "Đánh giá các thiết bị VR hiện đại nhất",
      "image": "https://placehold.co/600x400",
      "title": "Thực tế ảo - Tương lai của giải trí",
      "categoryName": "technology"
    },
    {
      "id": 16,
      "author": "Nguyen Thi P",
      "content": "Máy học đang cách mạng hóa cách doanh nghiệp phân tích và sử dụng dữ liệu. Bài viết giới thiệu các ứng dụng thực tế của máy học trong kinh doanh.",
      "createdAt": "2025-04-29T15:00:00",
      "description": "Ứng dụng của máy học trong kinh doanh",
      "image": "https://placehold.co/600x400",
      "title": "Máy học - Chìa khóa cho phân tích dữ liệu hiện đại",
      "categoryName": "technology"
    }
  ],
  "page": {
    "total_pages": 1,
    "has_next": false,
    "has_previous": false,
    "current_page": 1,
    "total_elements": 15
  },
  "extraData": null
}